In [7]:
import pandas as pd

In [17]:
data=pd.read_csv("../data/data1.csv")
df=data[["Name ","Roll","310241 TOC","310242 DBMS","310243 SEPM","310244 ISEE","310245 CN","Theory Attendance %"]]
df=df.dropna()
roll=[]
for i in range(1,76):
    roll.append(i)

df["roll_no"]=roll
df.to_csv("../data/A.csv")

In [15]:
df.head()

,Name,Roll,310241 TOC,310242 DBMS,310243 SEPM,310244 ISEE,310245 CN,Theory Attendance %,roll_no
1,AGRAWAL SAURABH VISHNU,3202001.0,1,2,0,0,0,5.17,1
2,AHIRE TANMAY SHIVPRASAD,3202002.0,4,11,10,1,7,56.90,2
3,AKHADE VINAYA SHANKAR,3202003.0,11,18,13,3,8,91.38,3
4,AKHIL APPASO SHINDE,3202004.0,6,16,13,1,7,74.14,4
5,ALONDRA MILAP MITESH,3202005.0,0,3,1,0,0,6.90,5

In [93]:
df.shape

(75, 8)

In [98]:
df.head()

,Name,Roll,310241 TOC,310242 DBMS,310243 SEPM,310244 ISEE,310245 CN,Theory Attendance %,roll_no
1,ADSUL SURAJ NAVNATH,3101001.0,1,2,2,1,1,12.07,1
2,ANAND PATIDAR,3101002.0,1,5,4,0,1,18.97,2
3,ANIKET KISAN CHAVAN,3101003.0,1,5,0,0,0,10.34,3
4,ANIKET RAJENDRA THORAT,3101004.0,0,18,13,2,5,65.52,4
5,APTE NAHUSH SHRINIVAS,3101005.0,9,20,13,2,3,81.03,5

In [115]:
data=df.loc[df["roll_no"]==4]
if data["310244 ISEE"].values[0] > 50:
    message="power attendace"
elif data["310244 ISEE"].values[0] < 50 and data["310244 ISEE"].values[0] > 75:
    message="you must have 75 % to grant your semester"
elif data["310244 ISEE"].values[0] < 75 and data["310244 ISEE"].values[0] > 80:
    message="good attendance"
elif data["310244 ISEE"].values[0] < 80:
    message="exelent attendace"

In [116]:
result={
    "Name":data["Name "].values[0],
    "RollNo":int(data["Roll"].values[0]),
    "TOC":data["310241 TOC"].values[0],
    "DBMS":data["310242 DBMS"].values[0],
    "SEPM":data["310243 SEPM"].values[0],
    "ISEE":data["310244 ISEE"].values[0],
    "Attendance":data["Theory Attendance %"].values[0]
}

In [112]:
result

{'Name': 'ANIKET RAJENDRA THORAT',
 'RollNo': 3101004,
 'TOC': 0,
 'DBMS': 18,
 'SEPM': 13,
 'ISEE': 2,
 'Attendance': 65.52}

In [113]:
a=data["310241 TOC"].values[0]

In [133]:
message

'good attendance'

In [144]:
data=81
if data < 50:
    message="power attendace"
elif data >= 50 and data < 74:
    message="you must have 75 % to grant your semester"
elif data >= 75 and data < 79:
    message="good attendance"
elif data > 80:
    message="exelent attendace"

In [145]:
message

'exelent attendace'